v2106/phaseChangeColumn/condensation/1x640/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e4;

boundaryField
{
    top
    {
        type            calculated;
        value           $internalField;
    }

    bottom
    {
        type            calculated;
       value           $internalField;
    }

    verticalWall
    {
        type            calculated;
        value           $internalField;
    }


    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
